app/mailers/order_mailer.rb

  def mail_to_user(order_id)
    @order = Order.find(order_id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]