app/views/orders/new.html.erb

        <div class="mb-2">*このサイトをどこでお知りになりましたか？(複数選択可)</div>
        <%= f.collection_check_boxes :inflow_source_ids, InflowSource.all, :id, :name do |inflow_source| %>
---
SELECT "inflow_sources".* FROM "inflow_sources"