app/views/order_mailer/mail_to_user.html.erb

[注文内容]<br>
<% @order.order_products.each do |order_product| %>
---
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 7]]