app/controllers/orders_controller.rb

  def new
    @order = Order.new
    @order.order_products.build
---
SELECT "products".* FROM "products"

  def confirm
    @order = Order.new(order_params)
    if params.key?(:add_product)
      @order.order_products << OrderProduct.new
---
SELECT "products".* FROM "products"
INSERT INTO "order_products" ("order_id", "product_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 7], ["product_id", 1], ["quantity", 1], ["created_at", "2023-01-28 18:09:37.889689"], ["updated_at", "2023-01-28 18:09:37.889689"]]
INSERT INTO "orders" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "makise"], ["created_at", "2023-01-16 12:19:49.745883"], ["updated_at", "2023-01-16 12:19:49.745883"]]

  def create
    @order = Order.new(order_params)
    return render :new if params[:button] == 'back'

    if @order.save
---
INSERT INTO "orders" ("name", "created_at", "updated_at", "email", "telephone", "delivery_address", "payment_method_id", "other_comment", "direct_mail_enabled") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def complete
    @order = Order.find_by(id: session[:order_id])
    return redirect_to new_order_url if @order.blank?
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]