app/models/payment_method.rb

    def selectable_methods
      all.map { |method| [method.name, method.id] }
---
SELECT "payment_methods".* FROM "payment_methods"